# 1
def ამოჭერი_პირველი_და_ბოლო(სიაში):
    return სიაში[1:-1]
print(ამოჭერი_პირველი_და_ბოლო(['ა', 'ბ', 'გ', 'დ']))

# 2
def გაამრავლე_ჯამები(სია1, სია2):
    ჯამი1 = 0
    ჯამი2 = 0

    for რიცხვი in სია1:
        ჯამი1 += რიცხვი
    for რიცხვი in სია2:
        ჯამი2 += რიცხვი

    return ჯამი1 * ჯამი2

print(გაამრავლე_ჯამები([1, 2, 3], [4, 5]))

# 3
def გააორმაგე_რიცხვები_ვაილით(რიცხვები):
    ინდექსი = 0
    ახალი_სია = []
    while ინდექსი < len(რიცხვები):
        ახალი_სია.append(რიცხვები[ინდექსი] * 2)
        ინდექსი += 1
    return ახალი_სია

print(გააორმაგე_რიცხვები_ვაილით([1, 2, 3])) 

# 4
def მხოლოდ_ლუწები(რიცხვები):
    ლუწები = []
    for რიცხვი in რიცხვები:
        if რიცხვი % 2 == 0:
            ლუწები.append(რიცხვი)
    return ლუწები

print(მხოლოდ_ლუწები([1, 2, 3, 4, 5, 6]))

# 5
def სახელები_N_ზე(სათაურები):
    შერჩეული = []
    for სახელი in სათაურები:
        if სახელი.startswith("N"):
            შერჩეული.append(სახელი)
    return შერჩეული
print(["NINO", "giorgi", "NATIA", "saba", "irakli"])