#   1) რაში გვეხმარება Indexing-ი?
# შესანიშნავია! აი **სამი უფრო მარტივი დავალება**, რაც ინდექსების გამოყენებას ეხება და შესაფერისია დამწყებთათვის:

# indexing გვეხმარება რომ ლისტებიდან ამოვირჩიოთ ერთი ნებისმიერი ტიპის მონაცემი.


# 2)შეიყვანე ტექსტი და დაბეჭდე მისი პირველი სიმბოლო.
txt = "hello"
print(txt[0])


# 3)
# მოცემულია სია: `['cat', 'dog', 'fish']`
# დაბეჭდე მეორე ელემენტი (ინდექსინგით).
# ელემენტი უნდა იყოს `"dog"`

pets = ['cat' , 'dog' , 'fish']
print(pets[1])


# 4)
# შეიყვანე ტექსტი და დაბეჭდე ბოლო სიმბოლო ინდექსის მეშვეობით (არა სლაისინგით და არა უარყოფითი ინდექსით).
# მაგ: "hello" → `o` (მოძებნე `len(text) - 1` ინდექსით)

text = input("enter text: ")
last_index = len(text) - 1
print("last index is:", text[last_index])
