# 1)ოცემულია სეტი A = {1, 2, 3, 4, 5}.
# დაწერე ამ სეტის ელემენტების რაოდენობა.
# ჩაწერე, არის თუ არა 3 სეტის ელემენტი.
# დაამატე რიცხვი 6 ამ სეტში.
# ამოიღე რიცხვი 2 სეტიდან.
A = {1, 2, 3, 4, 5}
A.add(6)
print(A)
A.remove(2)

# 2)მოცემულია ორი სეტი: A = {1, 2, 3} და B = {3, 4, 5}.
# იპოვე ამ სეტების გაერთიანება.
# იპოვე ამ სეტების გადაკვეთა.
# იპოვე სეტ A-დან ის ელემენტები, რომლებიც არ ეკუთვნის სეტ B-ს.
A = {1, 2, 3}
B = {3, 4, 5}
print(A | B)
print(A.union(B))
print(A & B)
print(A.intersection(B))
print(A - B)
print(A.difference(B))

# 3)მოცემულია სეტები A = {a, b, c} და B = {b, c, d}. იპოვე A და B-ის სიმეტრიული სხვაობა.
A = {"a", "b", "c"}
B = {"b", "c", "d"}
print(A ^ B)
print(A.symmetric_difference(B))
print(B ^ A)
print(B.symmetric_difference(A))

# 4)შექმენი სეტი
# გამოიყენე შესაბამისი მეთოდი ისე, რომ სეტი გახდეს ცარიელი.
# ამოიბეჭდოს მიღებული სეტი.

C = {2,4,5,6,7,8,9}
C.clear()
print(C)

# 5)შექმენით სეტი და შეინახეთ ელემენტები სასურველი რაოდენობით, შემდეგ კი შექმენით მეორე და საბოლოდ მობეჭდეთ სხვაობა ამ სეტებს შორის.
D = {1,2,3,4,5,6}
F = {4,5,1,23,543}
print(D - F)
print(F - D)
print(D.difference(F))
print(F.difference(D))