# cars = ["BMW" , "Mercedes" , "Pagani" , "Mazerati" ]
# cars[1] = "Tesla"
# cars[2] = "Nissan"
# print(cars)

# 2) რაში გვეხმარება ინდექსინგი? რა შეგივიძლია გავაკეთოთ ინდექსინგის მეშვეობით? შეგვიძლია თუ არა სტრინგების შეცვლა?
# indexing გვეხმარება რომ ლისტებიდან ამოვირჩიოთ ერთი ნებისმიერი ტიპის მონაცემი.
# შეგვიძლია ამოვირჩიოთ ინდექსზე არსებული სიტყვა და საჭიროებისამებრ შევცალოთ ან ერთმანეთს დავუმატოთ ან გამოვიყენოთ
# სტრინგების შეცვლა არ შეგვიძლია ინდექსინგით

# 3) txt = "hello world, python html" 
# --დაბეჭდეთ სტრინგის პირველი ასო,
# --დაბეჭდეთ სტრინგის ბოლო ასო ნეგატიური ინდექსის გამოყენებით,
# --ახსენი როგორ მუშაობს ინდექსები ანუ საიდან იწყება ასევე ნეგატიური ინდექსი საიდან იწყება 
txt = "hello world, python, html"
print(txt[0])
print(txt[-1])
# ინდექსები ათვლა იწყბება 0 დან და ის გვეხმარება რომ დავმნომროთ მონაცემთა რაოდენობა ან ციფრებისან ან თუმდაც ასოებთა რაოდენობა ხოლო ნეგატიური ინდექსი იწყება -1ით
